# 1759870
# 9870
# 590
money = input("문자를 입력하세요. ")
m_len = len(money)

if m_len > 4:
  print("만원 :",int(money) // 10000)
  print("오천원 :",(int(money) % 10000) // 5000)
  print("천원 :",((int(money) % 10000) % 5000) // 1000)
  print("오백원 :",(((int(money) % 10000) % 5000) % 10000) // 500)
  print("백원 :",((((int(money) % 10000) % 5000) % 10000) % 500) // 100)
  print("오십원 :",(((((int(money) % 10000) % 5000) % 10000) % 500) % 100) // 50)
  print("십원 :",((((((int(money) % 10000) % 5000) % 10000) % 500) % 100) % 50) // 10)
elif m_len > 3:
  print("천원 :",int(money) // 1000)
  print("오백원 :",(int(money) % 1000) // 500)
  print("백원 :",((int(money) % 1000) % 500) // 100)
  print("오십원 :",(((int(money) % 1000) % 500) % 100) // 50)
  print("십원 :",((((int(money) % 1000) % 500) % 100) % 50) // 10)
elif m_len > 2:
  print("오백원 :",int(money) // 500)
  print("백원 :",(int(money) % 500) // 100)
  print("오십원 :",((int(money) % 500) % 100) // 50)
  print("십원 :",(((int(money) % 500) % 100) % 50) // 10)
else:
  print(int(money))


# str1 = input("문자를 입력하세요. ")
# a = len(str1) # 문자의 길이 .length

# if a == 5:
#   print("a는 5입니다.")
# elif a == 4: # else if
#   print("a는 4입니다.")
# elif a == 3:
#   print("a는 3입니다.")
# else:
#   print("a 숫자는 2이하 입니다.")

# money = 1759870
# # 50000, 10000, 5000, 1000, 500, 100, 50, 10
# print("5만원 :", money // 50000)
# print("1만원 :", (money % 50000) // 10000)
# print("5천원 :", ((money % 50000) % 10000) // 5000)
# print("1천원 :", (((money % 50000) % 10000) % 5000) // 1000)
# print("오백원 :", ((((money % 50000) % 10000) % 5000) % 1000) // 500)
# print("백원 :", (((((money % 50000) % 10000) % 5000) % 1000) % 500) // 100)
# print("오십원 :", ((((((money % 50000) % 10000) % 5000) % 1000) % 500) % 100) // 50)
# print("십원 :", (((((((money % 50000) % 10000) % 5000) % 1000) % 500) % 100) % 50) // 10)

# money = 780
# # 500원 - 1개
# print("500원 동전개수 :",money // 500)
# # 100원 - 2개
# print("100원 동전개수 :",(money % 500) // 100)
# # 50원 - 1개
# print("50원 동전개수 :",((money % 500) % 100) // 50)
# # 10원 - 3개
# print("10원 동전개수 :",(((money % 500) % 100) % 50) // 10)