print("{} 평균 : {:.2f}".format("홍길동", (100 + 100 + 99) / 3))

# f함수 소수점 2자리 출력
a = 1.12345
print(f"소수점 2자리 출력 : {a:.2f}")

print("출력이 됩니다.!!")

print("""\
1.이후 온라인에서는 박 씨의 이름과 사진, SNS 계정 등 신상정보가 확산하고 있다. 박 씨가 운영
하는 것으로 알려진 찜닭집에는 별점 테러가 이어졌고, 일부 시민은 해당 식당을 찾아 달걀을 던
지는 등 분노를 드러냈다.\
      """)

# name = "홍길동"
# num = 100
# num2 = 100
# num3 = 99
# print("%s 합계 : %d" % (name, num + num2 + num3))
# print("{} 합계 : {}".format(name, num + num2 + num3))
# print("%s 평균 : %.2f" % (name, (num + num2 + num3) / 3))
# print("{} 평균 : {:.2f}".format(name, (num + num2 + num3) / 3))

# print("숫자 {:.2f}, {:.2f}, {:.2f}".format(12.12345, 456.78940, 2.252525))

# print("\\")
# print("안녕\n하세요.")
# print("안녕\t하세요.")
# print("안녕하세요.")

# print("이후 온라인에서는 박 씨의 이름과 사진, SNS 계정 등 신상정보가 확산하고 있다. 박 씨가 운영\n하는 것으로 알려진 찜닭집에는 별점 테러가 이어졌고, 일부 시민은 해당 식당을 찾아 달걀을 던\n지는 등 분노를 드러냈다.")

# print("""\
# 1.이후 온라인에서는 박 씨의 이름과 사진, SNS 계정 등 신상정보가 확산하고 있다. 박 씨가 운영
# 하는 것으로 알려진 찜닭집에는 별점 테러가 이어졌고, 일부 시민은 해당 식당을 찾아 달걀을 던
# 지는 등 분노를 드러냈다.
#       """)